%% Практическая работа 2 по МеРСИ...
..."Материальные расчеты процесса ректификации"
clear; clc; format; close all;

% w, mu вида [NaCl LiCl KCl]

%% Исходные данные
Cin = 0.25;
Cout = 1.2*10^(-5);
w = [0.2 0.3 0.5]; 
D = 3.2;
S1 = 18000; % мм

mu = [23+35.5 7+35.5 39+35.5];
n = length(w);

%% Расчет площади мембраны
Vp = (Cin-Cout)*D/3600;
mu_mean = mu(1)*w(1)+mu(2)*w(2)+mu(3)*w(3);
mu_mean = mu_mean / 1000;
Vtheory = mu_mean*7.5*0.9/966485.3328959;
Sm = 2*Vp / (0.85* Vtheory);

%% Общее количество мембран
N = Sm*(100*100)/S1;
N = ceil(N);

%% Сила тока
I = 7.5 / (10^6) * S1;

%% Сопротивление системы
R = 2.5 * 10^3 * 1 * N / S1;

%% Напряжение
U = I * R;

%% Мощность
P = U*I/0.9;