%% Практическая работа 6 по МеРСИ...
..."Построение матрицы планирования оптимального эксперимента" 
clear; clc; format; close all;

%% Исходные данные
Y = [0.57 0.68 0.51 0.16 0.63 0.17 0.91 0.41];
table = [1 -1 -1 -1 -1 1 1 1;
            1 1 -1 -1 1 1 -1 -1;
            1 -1 1 -1 1 -1 1 -1;
            1 1 1 -1 -1 -1 -1 1;
            1 -1 -1 1 -1 1 1 -1;
            1 1 -1 1 1 1 -1 1;
            1 -1 1 1 1 -1 1 1;
            1 1 1 1 -1 -1 -1 -1];
        
k = zeros(1, length(Y));
for i = 1:8
    k(i) = 0;
    for j = 1:8
        k(i) = k(i) + Y(j)*table(j,i);
    end
    k(i) = k(i)/8;
end

text = ['y=',num2str(k(1)),'+(', num2str(k(2)), ')x1+(', num2str(k(3)), ')x2+(', num2str(k(4)), ')x3+(', num2str(k(5)), ')x4+(', num2str(k(6)), ')x1x4+(', num2str(k(7)), ')x2x4+(', num2str(k(8)), ')x3x4'];
disp(text);